Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/flight_computer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# No power management — runs at full speed
CONFIG_PM_ENABLE=n

# No BLE on FlightComputer
CONFIG_BT_ENABLED=n

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: a relayed image boots PENDING_VERIFY and auto-reverts to ota_0
# unless the FC marks itself valid after resuming its I2S telemetry stream to
# the OC post-reboot. See docs/plans/08-ota-firmware-update.md §4 / §7.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
